rocksdb/experiments/M2/results/20260429-052804-budget-sensitivity/bmin_2_ptarget_0/budget_on/run_1/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 05:28:06 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777440486220427 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       6.736 micros/op 148453 ops/sec 33.681 seconds 5000000 operations;  147.2 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       8.894 micros/op 112429 ops/sec 44.472 seconds 5000000 operations;  111.5 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       9.814 micros/op 101893 ops/sec 49.071 seconds 5000000 operations;  101.1 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     16/0   996.56 MB   4.0      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    512.9     29.14             21.40       240    0.121       0      0       0.0       0.0
  L1     18/1    1.06 GB   4.0     25.9    13.6     12.3      23.0     10.7       0.0   1.7    384.9    341.9     69.03             52.93        20    3.452     26M  2950K       0.0       0.0
  L2     93/3    4.51 GB   1.8     21.5     9.1     12.4      16.4      3.9       0.6   1.8    401.3    305.2     54.90             41.82       142    0.387     21M  5245K       0.0       0.0
 Sum    127/4    6.54 GB   0.0     47.5    22.7     24.7      54.0     29.3       0.6   3.7    317.5    361.3    153.07            116.15       402    0.381     48M  8195K       0.0       0.0
 Int      0/0    0.00 KB   0.0     47.2    22.5     24.7      53.3     28.5       0.6   3.8    319.3    360.3    151.42            114.95       393    0.385     48M  8191K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     47.5    22.7     24.7      39.4     14.7       0.0   0.0    392.2    325.6    123.93             94.75       162    0.765     48M  8195K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    512.9     29.14             21.40       240    0.121       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 127.2 total, 124.2 interval
Flush(GB): cumulative 14.597, interval 14.111
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 54.01 GB write, 434.64 MB/s write, 47.46 GB read, 381.99 MB/s read, 153.1 seconds
Interval compaction: 53.28 GB write, 439.19 MB/s write, 47.22 GB read, 389.24 MB/s read, 151.4 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 16, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 16, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 16, total-stops: 0
interval: 16 total count
Block cache LRUCache@0x55a847b79df0#83552 capacity: 32.00 MB seed: 483025547 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000177 secs_since: 127
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 127.2 total, 124.2 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 118.73 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 118.73 MB/s
Cumulative stall: 00:00:30.178 H:M:S, 23.7 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14570.67 MB, 117.29 MB/s
Interval WAL: 14M writes, 0 syncs, 14468237.00 writes per sync, written: 14.23 GB, 117.29 MB/s
Interval stall: 00:00:30.178 H:M:S, 24.3 percent
Write Stall (count): write-buffer-manager-limit-stops: 0